In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
print(pd.__version__)

1.0.5

In [2]:
d = pd.Series([1,3,5,np.nan,6,8])
print(d)

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates=pd.date_range('20210101',periods=6)
dates

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df=pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))
df

                   A         B         C         D
2021-01-01 -0.922930  0.025330 -1.856245  0.584681
2021-01-02  0.372295 -1.130714 -0.413598 -0.679330
2021-01-03 -0.449184 -2.024003 -0.205167 -0.851405
2021-01-04  0.615901 -0.686107  1.371918 -0.597349
2021-01-05  0.589047 -0.207526 -0.598660 -0.675100
2021-01-06 -0.146016 -2.619195  0.211750  0.413924

In [7]:
df2=pd.DataFrame({'A':1.,
                  'B':pd.Timestamp('20210102'),
                  'C':pd.Series(1,index=list(range(4)),dtype='float64'),
                  'D':np.array([3]*4,dtype='int32'),
                  'E':pd.Categorical(["test","train","test","train"]),
                  'F':'BTech VI Sem'})
df2

     A          B    C  D      E             F
0  1.0 2021-01-02  1.0  3   test  BTech VI Sem
1  1.0 2021-01-02  1.0  3  train  BTech VI Sem
2  1.0 2021-01-02  1.0  3   test  BTech VI Sem
3  1.0 2021-01-02  1.0  3  train  BTech VI Sem

In [8]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float64
D             int32
E          category
F            object
dtype: object

In [9]:
s = pd.Series(np.random.randn(5), index=["a", "b", "c", "d", "e"])
s

a   -0.397182
b    1.835496
c    2.057690
d    0.226069
e   -0.070796
dtype: float64

In [10]:
s.array

<PandasArray>
[-0.39718238252336086,   1.8354962871689702,   2.0576895629451593,
  0.22606922878663271,  -0.0707962250302958]
Length: 5, dtype: float64

In [11]:
s.index.array

<PandasArray>
['a', 'b', 'c', 'd', 'e']
Length: 5, dtype: object

In [12]:
s.to_numpy()

array([-0.39718238,  1.83549629,  2.05768956,  0.22606923, -0.07079623])

In [13]:
np.asarray(s)

array([-0.39718238,  1.83549629,  2.05768956,  0.22606923, -0.07079623])

In [17]:
df.columns = [x.lower() for x in df.columns]
df

                   a         b         c         d
2021-01-01 -0.922930  0.025330 -1.856245  0.584681
2021-01-02  0.372295 -1.130714 -0.413598 -0.679330
2021-01-03 -0.449184 -2.024003 -0.205167 -0.851405
2021-01-04  0.615901 -0.686107  1.371918 -0.597349
2021-01-05  0.589047 -0.207526 -0.598660 -0.675100
2021-01-06 -0.146016 -2.619195  0.211750  0.413924

In [21]:
df.head(2)

                   a         b         c         d
2021-01-01 -0.922930  0.025330 -1.856245  0.584681
2021-01-02  0.372295 -1.130714 -0.413598 -0.679330

In [22]:
df.tail(3)

                   a         b         c         d
2021-01-04  0.615901 -0.686107  1.371918 -0.597349
2021-01-05  0.589047 -0.207526 -0.598660 -0.675100
2021-01-06 -0.146016 -2.619195  0.211750  0.413924

In [23]:
df.index

DatetimeIndex(['2021-01-01', '2021-01-02', '2021-01-03', '2021-01-04',
               '2021-01-05', '2021-01-06'],
              dtype='datetime64[ns]', freq='D')

In [24]:
df.describe()

              a         b         c         d
count  6.000000  6.000000  6.000000  6.000000
mean   0.009852 -1.107036 -0.248333 -0.300763
std    0.622771  1.038900  1.055857  0.627599
min   -0.922930 -2.619195 -1.856245 -0.851405
25%   -0.373392 -1.800681 -0.552394 -0.678273
50%    0.113140 -0.908410 -0.309382 -0.636224
75%    0.534859 -0.327171  0.107520  0.161106
max    0.615901  0.025330  1.371918  0.584681

In [25]:
df.shape

(6, 4)

In [26]:
df

                   a         b         c         d
2021-01-01 -0.922930  0.025330 -1.856245  0.584681
2021-01-02  0.372295 -1.130714 -0.413598 -0.679330
2021-01-03 -0.449184 -2.024003 -0.205167 -0.851405
2021-01-04  0.615901 -0.686107  1.371918 -0.597349
2021-01-05  0.589047 -0.207526 -0.598660 -0.675100
2021-01-06 -0.146016 -2.619195  0.211750  0.413924

In [27]:
df.T

   2021-01-01  2021-01-02  2021-01-03  2021-01-04  2021-01-05  2021-01-06
a   -0.922930    0.372295   -0.449184    0.615901    0.589047   -0.146016
b    0.025330   -1.130714   -2.024003   -0.686107   -0.207526   -2.619195
c   -1.856245   -0.413598   -0.205167    1.371918   -0.598660    0.211750
d    0.584681   -0.679330   -0.851405   -0.597349   -0.675100    0.413924

In [37]:
df.sort_values(by='b')

                   a         b         c         d
2021-01-06 -0.146016 -2.619195  0.211750  0.413924
2021-01-03 -0.449184 -2.024003 -0.205167 -0.851405
2021-01-02  0.372295 -1.130714 -0.413598 -0.679330
2021-01-04  0.615901 -0.686107  1.371918 -0.597349
2021-01-05  0.589047 -0.207526 -0.598660 -0.675100
2021-01-01 -0.922930  0.025330 -1.856245  0.584681

In [35]:
df.sort_index(ascending=False)

                   a         b         c         d
2021-01-06 -0.146016 -2.619195  0.211750  0.413924
2021-01-05  0.589047 -0.207526 -0.598660 -0.675100
2021-01-04  0.615901 -0.686107  1.371918 -0.597349
2021-01-03 -0.449184 -2.024003 -0.205167 -0.851405
2021-01-02  0.372295 -1.130714 -0.413598 -0.679330
2021-01-01 -0.922930  0.025330 -1.856245  0.584681

In [38]:
df['a']

2021-01-01   -0.922930
2021-01-02    0.372295
2021-01-03   -0.449184
2021-01-04    0.615901
2021-01-05    0.589047
2021-01-06   -0.146016
Freq: D, Name: a, dtype: float64

In [39]:
df[1:3]

                   a         b         c         d
2021-01-02  0.372295 -1.130714 -0.413598 -0.679330
2021-01-03 -0.449184 -2.024003 -0.205167 -0.851405

In [40]:
df['20210102':'20210104']

                   a         b         c         d
2021-01-02  0.372295 -1.130714 -0.413598 -0.679330
2021-01-03 -0.449184 -2.024003 -0.205167 -0.851405
2021-01-04  0.615901 -0.686107  1.371918 -0.597349

In [41]:
df.loc[dates[0]]

a   -0.922930
b    0.025330
c   -1.856245
d    0.584681
Name: 2021-01-01 00:00:00, dtype: float64

In [43]:
df.loc[:,['a','b']]

                   a         b
2021-01-01 -0.922930  0.025330
2021-01-02  0.372295 -1.130714
2021-01-03 -0.449184 -2.024003
2021-01-04  0.615901 -0.686107
2021-01-05  0.589047 -0.207526
2021-01-06 -0.146016 -2.619195

In [45]:
df.loc['20210102':'20210104',['a','b']]

                   a         b
2021-01-02  0.372295 -1.130714
2021-01-03 -0.449184 -2.024003
2021-01-04  0.615901 -0.686107

In [47]:
df.loc['20210102',['a','b']]

a    0.372295
b   -1.130714
Name: 2021-01-02 00:00:00, dtype: float64

In [49]:
df.loc[dates[0],'a']

-0.922930428927695

In [50]:
df.iloc[3]

a    0.615901
b   -0.686107
c    1.371918
d   -0.597349
Name: 2021-01-04 00:00:00, dtype: float64

In [51]:
 df.iloc[3:5,0:2]

                   a         b
2021-01-04  0.615901 -0.686107
2021-01-05  0.589047 -0.207526

In [52]:
df.iloc[[1,2,4],[0,2]]

                   a         c
2021-01-02  0.372295 -0.413598
2021-01-03 -0.449184 -0.205167
2021-01-05  0.589047 -0.598660

In [53]:
df.iloc[:,1:3]

                   b         c
2021-01-01  0.025330 -1.856245
2021-01-02 -1.130714 -0.413598
2021-01-03 -2.024003 -0.205167
2021-01-04 -0.686107  1.371918
2021-01-05 -0.207526 -0.598660
2021-01-06 -2.619195  0.211750

In [54]:
df.iloc[1,1]

-1.1307143217839395

In [56]:
df[df.a>0]

                   a         b         c         d
2021-01-02  0.372295 -1.130714 -0.413598 -0.679330
2021-01-04  0.615901 -0.686107  1.371918 -0.597349
2021-01-05  0.589047 -0.207526 -0.598660 -0.675100

In [61]:
df[df.c>0]

                   a         b         c         d
2021-01-04  0.615901 -0.686107  1.371918 -0.597349
2021-01-06 -0.146016 -2.619195  0.211750  0.413924

In [62]:
df2=df.copy()

In [63]:
df2

                   a         b         c         d
2021-01-01 -0.922930  0.025330 -1.856245  0.584681
2021-01-02  0.372295 -1.130714 -0.413598 -0.679330
2021-01-03 -0.449184 -2.024003 -0.205167 -0.851405
2021-01-04  0.615901 -0.686107  1.371918 -0.597349
2021-01-05  0.589047 -0.207526 -0.598660 -0.675100
2021-01-06 -0.146016 -2.619195  0.211750  0.413924

In [64]:
df3=df
df3

                   a         b         c         d
2021-01-01 -0.922930  0.025330 -1.856245  0.584681
2021-01-02  0.372295 -1.130714 -0.413598 -0.679330
2021-01-03 -0.449184 -2.024003 -0.205167 -0.851405
2021-01-04  0.615901 -0.686107  1.371918 -0.597349
2021-01-05  0.589047 -0.207526 -0.598660 -0.675100
2021-01-06 -0.146016 -2.619195  0.211750  0.413924

In [65]:
df2['e']=['one','one','two','three','four','three']

In [66]:
df2

                   a         b         c         d      e
2021-01-01 -0.922930  0.025330 -1.856245  0.584681    one
2021-01-02  0.372295 -1.130714 -0.413598 -0.679330    one
2021-01-03 -0.449184 -2.024003 -0.205167 -0.851405    two
2021-01-04  0.615901 -0.686107  1.371918 -0.597349  three
2021-01-05  0.589047 -0.207526 -0.598660 -0.675100   four
2021-01-06 -0.146016 -2.619195  0.211750  0.413924  three

In [67]:
df2[df2['e'].isin(['two','four'])]

                   a         b         c         d     e
2021-01-03 -0.449184 -2.024003 -0.205167 -0.851405   two
2021-01-05  0.589047 -0.207526 -0.598660 -0.675100  four

In [69]:
s1=pd.Series([1,2,3,4,5,6],index=pd.date_range('20210102',periods=6))
s1

2021-01-02    1
2021-01-03    2
2021-01-04    3
2021-01-05    4
2021-01-06    5
2021-01-07    6
Freq: D, dtype: int64

In [70]:
df['f']=s1

In [71]:
df

                   a         b         c         d    f
2021-01-01 -0.922930  0.025330 -1.856245  0.584681  NaN
2021-01-02  0.372295 -1.130714 -0.413598 -0.679330  1.0
2021-01-03 -0.449184 -2.024003 -0.205167 -0.851405  2.0
2021-01-04  0.615901 -0.686107  1.371918 -0.597349  3.0
2021-01-05  0.589047 -0.207526 -0.598660 -0.675100  4.0
2021-01-06 -0.146016 -2.619195  0.211750  0.413924  5.0

In [72]:
df.at[dates[0],'f']=0

In [73]:
df

                   a         b         c         d    f
2021-01-01 -0.922930  0.025330 -1.856245  0.584681  0.0
2021-01-02  0.372295 -1.130714 -0.413598 -0.679330  1.0
2021-01-03 -0.449184 -2.024003 -0.205167 -0.851405  2.0
2021-01-04  0.615901 -0.686107  1.371918 -0.597349  3.0
2021-01-05  0.589047 -0.207526 -0.598660 -0.675100  4.0
2021-01-06 -0.146016 -2.619195  0.211750  0.413924  5.0

In [75]:
df.iat[0,1]=0
df

                   a         b         c         d    f
2021-01-01 -0.922930  0.000000 -1.856245  0.584681  0.0
2021-01-02  0.372295 -1.130714 -0.413598 -0.679330  1.0
2021-01-03 -0.449184 -2.024003 -0.205167 -0.851405  2.0
2021-01-04  0.615901 -0.686107  1.371918 -0.597349  3.0
2021-01-05  0.589047 -0.207526 -0.598660 -0.675100  4.0
2021-01-06 -0.146016 -2.619195  0.211750  0.413924  5.0

In [77]:
df.loc[:,'d']=np.array([5]*len(df))
df

                   a         b         c  d    f  D
2021-01-01 -0.922930  0.000000 -1.856245  5  0.0  5
2021-01-02  0.372295 -1.130714 -0.413598  5  1.0  5
2021-01-03 -0.449184 -2.024003 -0.205167  5  2.0  5
2021-01-04  0.615901 -0.686107  1.371918  5  3.0  5
2021-01-05  0.589047 -0.207526 -0.598660  5  4.0  5
2021-01-06 -0.146016 -2.619195  0.211750  5  5.0  5

In [80]:
df1=df.reindex(index=dates[0:4],columns=list(df.columns)+['E'])

In [81]:
df1

                   a         b         c  d    f  D   E
2021-01-01 -0.922930  0.000000 -1.856245  5  0.0  5 NaN
2021-01-02  0.372295 -1.130714 -0.413598  5  1.0  5 NaN
2021-01-03 -0.449184 -2.024003 -0.205167  5  2.0  5 NaN
2021-01-04  0.615901 -0.686107  1.371918  5  3.0  5 NaN

In [82]:
df1.loc[dates[0]:dates[1],'E']=1
df1

                   a         b         c  d    f  D    E
2021-01-01 -0.922930  0.000000 -1.856245  5  0.0  5  1.0
2021-01-02  0.372295 -1.130714 -0.413598  5  1.0  5  1.0
2021-01-03 -0.449184 -2.024003 -0.205167  5  2.0  5  NaN
2021-01-04  0.615901 -0.686107  1.371918  5  3.0  5  NaN

In [84]:
df1.dropna(how='any')

                   a         b         c  d    f  D    E
2021-01-01 -0.922930  0.000000 -1.856245  5  0.0  5  1.0
2021-01-02  0.372295 -1.130714 -0.413598  5  1.0  5  1.0

In [85]:
df1.fillna(value=5)

                   a         b         c  d    f  D    E
2021-01-01 -0.922930  0.000000 -1.856245  5  0.0  5  1.0
2021-01-02  0.372295 -1.130714 -0.413598  5  1.0  5  1.0
2021-01-03 -0.449184 -2.024003 -0.205167  5  2.0  5  5.0
2021-01-04  0.615901 -0.686107  1.371918  5  3.0  5  5.0

In [86]:
pd.isnull(df1)

                a      b      c      d      f      D      E
2021-01-01  False  False  False  False  False  False  False
2021-01-02  False  False  False  False  False  False  False
2021-01-03  False  False  False  False  False  False   True
2021-01-04  False  False  False  False  False  False   True

In [87]:
df.mean()

a    0.009852
b   -1.111257
c   -0.248333
d    5.000000
f    2.500000
D    5.000000
dtype: float64

In [88]:
df.mean(1)

2021-01-01    1.203471
2021-01-02    1.637997
2021-01-03    1.553608
2021-01-04    2.383619
2021-01-05    2.297144
2021-01-06    2.074423
Freq: D, dtype: float64

In [89]:
s=pd.Series([1,3,5,np.nan,6,8],index=dates).shift(2)

In [90]:
s

2021-01-01    NaN
2021-01-02    NaN
2021-01-03    1.0
2021-01-04    3.0
2021-01-05    5.0
2021-01-06    NaN
Freq: D, dtype: float64

In [93]:
 df

                   a         b         c  d    f  D
2021-01-01 -0.922930  0.000000 -1.856245  5  0.0  5
2021-01-02  0.372295 -1.130714 -0.413598  5  1.0  5
2021-01-03 -0.449184 -2.024003 -0.205167  5  2.0  5
2021-01-04  0.615901 -0.686107  1.371918  5  3.0  5
2021-01-05  0.589047 -0.207526 -0.598660  5  4.0  5
2021-01-06 -0.146016 -2.619195  0.211750  5  5.0  5

## Lab 10 Exercise
1. WAP using Pandas to create a series from a list, numpy array and dict
2. WAP using Pandas to convert the index of a series into a column of a dataframe
3. WAP using Pandas to combine many series to form a dataframe
4. WAP using Pandas to add, subtract, multiple and divide two Pandas Series. 
5. WAP using Pandas to compare the elements of the two Pandas Series.
6. WAP using Pandas to create a datafame as follows
    ### Name  Score    Attempts    Qualify
        Ana    45       5          no
        Priya  65       3          yes
        Charu  78       4          yes
        Suchi  12       4          no
        Richa  4        2          no
7. WAP using Pandas to get the first 3 rows of a given DataFrame.
8. WAP using Pandas to select the 'name' and 'score' columns from the following DataFrame.
9. WAP using Pandas to select the specified columns and rows from a given data frame.
10. WAP using Pandas  to select the rows the score is between 0 and 20.
11. WAP using Pandas to select the rows where number of attempts in the examination is less than 4 and score greater than 50.
12. WAP using Pandas  to calculate the sum of the examination attempts by the students.

In [1]:
import pandas as pd
import numpy as np

In [11]:
#Q1

In [2]:
df = pd.Series([1,2,3,4,5])
df

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
df = pd.Series(np.array([3]*4, dtype='int32'))
df

0    3
1    3
2    3
3    3
dtype: int32

In [10]:
df = pd.Series({'a':1,
                'b':2}, dtype='int32')
df

a    1
b    2
dtype: int32

In [25]:
#Q2
df = pd.Series([1,2,3,4,5,6],index=['a','b','c','d','e','f'])
df

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [15]:
df2=pd.DataFrame({'A':1.,
                  'B':pd.Timestamp('20210102'),
                  'C':pd.Series(1,index=list(range(4)),dtype='float64'),
                  'D':np.array([3]*4,dtype='int32'),
                  'E':pd.Categorical(["test","train","test","train"]),
                  'F':'BTech VI Sem'})
df2

     A          B    C  D      E             F
0  1.0 2021-01-02  1.0  3   test  BTech VI Sem
1  1.0 2021-01-02  1.0  3  train  BTech VI Sem
2  1.0 2021-01-02  1.0  3   test  BTech VI Sem
3  1.0 2021-01-02  1.0  3  train  BTech VI Sem

In [17]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [22]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [26]:
df2.columns = df.index
df2.columns

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [27]:
df2

     a          b    c  d      e             f
0  1.0 2021-01-02  1.0  3   test  BTech VI Sem
1  1.0 2021-01-02  1.0  3  train  BTech VI Sem
2  1.0 2021-01-02  1.0  3   test  BTech VI Sem
3  1.0 2021-01-02  1.0  3  train  BTech VI Sem

In [28]:
#Q3

In [31]:
def createSeries (series_list):
    
  # create a series
      series_list = pd.Series(series_list)
    
      return series_list

students = createSeries(['ABC', 'DEF',
                         'GHI', 'JKL',
                         'MNO', 'PQR'])  
# create a series of subjects
subject = createSeries(['C++', 'C#', 
                        'RUBY', 'SWIFT',
                        'GO', 'PYTHON'])
# create a series of marks
marks = createSeries([90, 30, 
                      50, 70, 
                      80, 60])
# create a dictonary
data = {"students": students,
        "subject": subject,
        "marks": marks}
  
# Concatenating the series side
# by side as depicted by axis=1
# If you want to concatenate the 
# series one below the other
# change the axis to zero.
df = pd.concat(data,
               axis = 1)
  
# show the dataframe
df

  students subject  marks
0      ABC     C++     90
1      DEF      C#     30
2      GHI    RUBY     50
3      JKL   SWIFT     70
4      MNO      GO     80
5      PQR  PYTHON     60

In [32]:
#Q4
ds1 = pd.Series([2, 4, 6, 8, 10])
ds2 = pd.Series([1, 3, 5, 7, 9])
ds = ds1 + ds2
print("Add two Series:")
print(ds)
print("Subtract two Series:")
ds = ds1 - ds2
print(ds)
print("Multiply two Series:")
ds = ds1 * ds2
print(ds)
print("Divide Series1 by Series2:")
ds = ds1 / ds2
print(ds)

Add two Series:
0     3
1     7
2    11
3    15
4    19
dtype: int64
Subtract two Series:
0    1
1    1
2    1
3    1
4    1
dtype: int64
Multiply two Series:
0     2
1    12
2    30
3    56
4    90
dtype: int64
Divide Series1 by Series2:
0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

In [33]:
#Q5

In [34]:
ds1 = pd.Series([2, 4, 6, 8, 10])
ds2 = pd.Series([1, 3, 5, 7, 10])
print("Series1:")
print(ds1)
print("Series2:")
print(ds2)
print("Compare the elements of the said Series:")
print("Equals:")
print(ds1 == ds2)
print("Greater than:")
print(ds1 > ds2)
print("Less than:")
print(ds1 < ds2)

Series1:
0     2
1     4
2     6
3     8
4    10
dtype: int64
Series2:
0     1
1     3
2     5
3     7
4    10
dtype: int64
Compare the elements of the said Series:
Equals:
0    False
1    False
2    False
3    False
4     True
dtype: bool
Greater than:
0     True
1     True
2     True
3     True
4    False
dtype: bool
Less than:
0    False
1    False
2    False
3    False
4    False
dtype: bool

In [36]:
#Q6
df =  pd.DataFrame({
    'Name':['Ana','Priya','Charu','Suchi','Richa'],
    'Score':pd.Series([45,65,78,12,4]),
    'Attempts':pd.Series([5,3,4,4,2]),
    'Qualify':pd.Categorical(["no","yes","yes","no","no"])
})
df

    Name  Score  Attempts Qualify
0    Ana     45         5      no
1  Priya     65         3     yes
2  Charu     78         4     yes
3  Suchi     12         4      no
4  Richa      4         2      no

In [38]:
#Q7
df.iloc[0:3,:]

    Name  Score  Attempts Qualify
0    Ana     45         5      no
1  Priya     65         3     yes
2  Charu     78         4     yes

In [39]:
df.loc['0':'2']

    Name  Score  Attempts Qualify
0    Ana     45         5      no
1  Priya     65         3     yes
2  Charu     78         4     yes

In [40]:
#Q8 WAP using Pandas to select the 'name' and 'score' columns from the following DataFrame
df.iloc[:,0:2]

    Name  Score
0    Ana     45
1  Priya     65
2  Charu     78
3  Suchi     12
4  Richa      4

In [45]:
#Q9 WAP using Pandas to select the specified columns and rows from a given data frame.
df.iloc[[1,2],[0,1]]

    Name  Score
1  Priya     65
2  Charu     78

In [55]:
#Q10 WAP using Pandas to select the rows the score is between 0 and 20.
df = df[df.Score>30]
df[df.Score<50]

  Name  Score  Attempts Qualify
0  Ana     45         5      no

In [57]:
#Q11 WAP using Pandas to select the rows where number of attempts in the examination is less than 4 and score greater than 50.
df = df[df.Attempts<4]
df[df.Score>50]

    Name  Score  Attempts Qualify
1  Priya     65         3     yes

In [58]:
#Q12 WAP using Pandas to calculate the sum of the examination attempts by the students.
np.sum(df.Attempts)

3